cos472-sws.org
#+TITLE: COS 371, 372, 471, 472---Software Studio
#+DATE: Spring 2016

#+STARTUP: indent
#+OPTIONS: toc:nil author:nil ':t

#+LATEX_CLASS: syllabus
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage[margin=1.5in]{geometry}
#+LATEX_HEADER: \usepackage{lastpage}
#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \pagestyle{fancy}
#+LATEX_HEADER: \lhead{COS 371, 372, 471, 472---Software Studio}
#+LATEX_HEADER: \chead{}
#+LATEX_HEADER: \rhead{Course Syllabus}
#+LATEX_HEADER: \lfoot{Spring 2016}
#+LATEX_HEADER: \cfoot{}
#+LATEX_HEADER: \rfoot{Page \thepage\ of \pageref{LastPage}}
#+LATEX_HEADER: \renewcommand{\headrulewidth}{0.4pt}
#+LATEX_HEADER: \renewcommand{\footrulewidth}{0.4pt}
#+LATEX_HEADER: \renewcommand\maketitle\relax

* Instructor
*Dr. Tom Nurkkala*\\
Associate Professor, Computer Science and Engineering\\
Director, Taylor Center for Missions Computing\\
Office: Euler Science 211\\
E-Mail: =tnurkkala@cse.taylor.edu=\\
Phone: 8-5163\\
Hours: MW 2:00-4:00, R 1:00-2:00, or by appointment
* Objective
*Software Studio trains you as a world-class software engineer*.
We do this by engaging you in an agile, team-based software engineering organization
that develops and delivers non-trivial software for real, external partners.
As a result, you will acquire:
+ Improved skills in all phases of the software development lifecycle
+ Direct experience developing non-trivial software that is of sufficient maturity and
  quality to be deployed and used by our external partners
+ Concrete skills in project management, software configuration management, and project
  feature and defect tracking
+ Personal time management and tracking skills
+ A deeper understanding of software engineering from current and historical literature on
  software engineering, programming, process, management, and related areas.
+ Better written and spoken communication skills as you interact with your peers, our
  partners, and your instructor
+ Specific skills in the languages, middleware, databases, and related technologies
  associated with our project work
In short, I want you to master all the practical and theoretical skills
that will make you someone I would be delighted to hire
for a challenging and responsible position as a professional software engineer.

* Culture
Studio inculcates a definite culture.
Following are some of Studio's cultural characteristics.

** Software Studio Delivers Working Products
Many of your classes feature "projects" of different size and complexity.
Software Studio is not one of them.
Instead, our focus is on /products/.
Whereas a /project/ implies a kind of nebulous open-endedness,
a /product/ is
/working software/
that /satisfies its design requirements/
and is /delivered/ to a /delighted/ customer.

** Software Studio is Opinionated
The goal of Software Studio is to train you to be world-class software engineer.
To get there, you need to know and wield powerful, world-class software tools.

Studio is a *Unix* shop.
Dating to the early 1970's,
Unix remains the most powerful operating system in common use.
It's true that Windows dominates the world's desktops.
But if Windows is the backyard pool behind suburban houses worldwide,
Unix is the North Sea: wild and powerful and
filled with cargo freighters and battleships.
In Studio, "Unix" includes various flavors and derivatives of the original OS,
particularly *Linux*, but also *Mac OS*, *Android*, and *iOS*.

Studio uses best-of-breed tools.
I particularly recommend *Emacs*.
Far more than a mere editor,
=emacs= has been called an /extensible computing environment/.
Critically, it can be extended by its users to perform a myriad of amazing feats,
just a fraction of which you will learn and leverage.
Knowing other editors is helpful; I regularly use =vi= for small tasks.
But if =vi= is a pontoon boat,
=emacs= is a nuclear submarine. That flies. In space.

Other best-of-breed technologies used in Software Studio include:
+ *Ubuntu* as our standard Linux distribution
+ *Git* and *Github* for revision control
+ *Python*, *JavaScript*, *Objective-C* (iOS), *Java* (Android)
+ *Django* backed by *SQLite* (development) and *PostgreSQL* (production)
+ *Angular* backed by *Node*, *Express*, and *MongoDB*
+ *React* and *Redux* for client side components
+ *Trello* for project and sprint backlogs,
  together with *Plus for Trello* (Chrome extension) for time tracking and management.
+ *Meteor* for real-time web applications
** Software Studio is Agile
Studio embraces an agile software development methodology
based largely on *Scrum*.
We are driven by customer requirements,
create software that is adaptable to change,
and interact with our customers early and often during development.
We also incorporate selected ideas from *Extreme Programming*,
*Kanban*, and *Pomodoro*.
** Software Studio Emphasizes Service
The products that we build serve a bigger purpose.
We focus especially on software that meets the needs
of the *global Christian missions community*
or other non-profit and relief organizations.
The *Taylor Center for Missions Computing*
is a key partner in this regard.
As a good citizen of the Taylor community,
Studio also sometimes develops products for other parts of the university.
** Software Studio is Intensely Practical
Studio teaches you the skills necessary
to deliver amazing products to our customers.
We focus on two broad categories of skills:
/software/ skills and /system/ skills.

*Software skills* include requirements elicitation, coding, debugging, unit testing,
revision control, continuous integration, continuous deployment,
project management, code reviews, and defect tracking.

*System skills* include, operating system virtualization; installation, configuration,
maintenance, and administration of the operating system, network, database management
system, and web server; software deployment; and disaster planning
