cos472-sws.tex
% Created 2016-02-04 Thu 11:45
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{booktabs}
\usepackage[margin=1.5in]{geometry}
\usepackage{lastpage}
\usepackage{fancyhdr}
\pagestyle{fancy}
\lhead{COS 371, 372, 471, 472---Software Studio}
\chead{}
\rhead{Course Syllabus}
\lfoot{Spring 2016}
\cfoot{}
\rfoot{Page \thepage\ of \pageref{LastPage}}
\renewcommand{\headrulewidth}{0.4pt}
\renewcommand{\footrulewidth}{0.4pt}
\renewcommand\maketitle\relax
\date{Spring 2016}
\title{COS 371, 372, 471, 472---Software Studio}
\hypersetup{
 pdfauthor={Tom Nurkkala},
 pdftitle={COS 371, 372, 471, 472---Software Studio},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.3)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Instructor}
\label{sec:orgheadline1}
\textbf{Dr. Tom Nurkkala}\\
Associate Professor, Computer Science and Engineering\\
Director, Taylor Center for Missions Computing\\
Office: Euler Science 211\\
E-Mail: \texttt{tnurkkala@cse.taylor.edu}\\
Phone: 8-5163\\
Hours: MW 2:00-4:00, R 1:00-2:00, or by appointment
\section{Objective}
\label{sec:orgheadline2}
\textbf{Software Studio trains you as a world-class software engineer}.
We do this by engaging you in an agile, team-based software engineering organization
that develops and delivers non-trivial software for real, external partners.
As a result, you will acquire:
\begin{itemize}
\item Improved skills in all phases of the software development lifecycle
\item Direct experience developing non-trivial software that is of sufficient maturity and
quality to be deployed and used by our external partners
\item Concrete skills in project management, software configuration management, and project
feature and defect tracking
\item Personal time management and tracking skills
\item A deeper understanding of software engineering from current and historical literature on
software engineering, programming, process, management, and related areas.
\item Better written and spoken communication skills as you interact with your peers, our
partners, and your instructor
\item Specific skills in the languages, middleware, databases, and related technologies
associated with our project work
\end{itemize}
In short, I want you to master all the practical and theoretical skills
that will make you someone I would be delighted to hire
for a challenging and responsible position as a professional software engineer.

\section{Culture}
\label{sec:orgheadline9}
Studio inculcates a definite culture.
Following are some of Studio's cultural characteristics.

\subsection{Software Studio Delivers Working Products}
\label{sec:orgheadline3}
Many of your classes feature ``projects'' of different size and complexity.
Software Studio is not one of them.
Instead, our focus is on \emph{products}.
Whereas a \emph{project} implies a kind of nebulous open-endedness,
a \emph{product} is
\emph{working software}
that \emph{satisfies its design requirements}
and is \emph{delivered} to a \emph{delighted} customer.

\subsection{Software Studio is Opinionated}
\label{sec:orgheadline4}
The goal of Software Studio is to train you to be world-class software engineer.
To get there, you need to know and wield powerful, world-class software tools.

Studio is a \textbf{Unix} shop.
Dating to the early 1970's,
Unix remains the most powerful operating system in common use.
It's true that Windows dominates the world's desktops.
But if Windows is the backyard pool behind suburban houses worldwide,
Unix is the North Sea: wild and powerful and
filled with cargo freighters and battleships.
In Studio, ``Unix'' includes various flavors and derivatives of the original OS,
particularly \textbf{Linux}, but also \textbf{Mac OS}, \textbf{Android}, and \textbf{iOS}.

Studio uses best-of-breed tools.
I particularly recommend \textbf{Emacs}.
Far more than a mere editor,
\texttt{emacs} has been called an \emph{extensible computing environment}.
Critically, it can be extended by its users to perform a myriad of amazing feats,
just a fraction of which you will learn and leverage.
Knowing other editors is helpful; I regularly use \texttt{vi} for small tasks.
But if \texttt{vi} is a pontoon boat,
\texttt{emacs} is a nuclear submarine. That flies. In space.

Other best-of-breed technologies used in Software Studio include:
\begin{itemize}
\item \textbf{Ubuntu} as our standard Linux distribution
\item \textbf{Git} and \textbf{Github} for revision control
\item \textbf{Python}, \textbf{JavaScript}, \textbf{Objective-C} (iOS), \textbf{Java} (Android)
\item \textbf{Django} backed by \textbf{SQLite} (development) and \textbf{PostgreSQL} (production)
\item \textbf{Angular} backed by \textbf{Node}, \textbf{Express}, and \textbf{MongoDB}
\item \textbf{React} and \textbf{Redux} for client side components
\item \textbf{Trello} for project and sprint backlogs,
together with \textbf{Plus for Trello} (Chrome extension) for time tracking and management.
\item \textbf{Meteor} for real-time web applications
\end{itemize}
\subsection{Software Studio is Agile}
\label{sec:orgheadline5}
Studio embraces an agile software development methodology
based largely on \textbf{Scrum}.
We are driven by customer requirements,
create software that is adaptable to change,
and interact with our customers early and often during development.
We also incorporate selected ideas from \textbf{Extreme Programming},
\textbf{Kanban}, and \textbf{Pomodoro}.
\subsection{Software Studio Emphasizes Service}
\label{sec:orgheadline6}
The products that we build serve a bigger purpose.
We focus especially on software that meets the needs
of the \textbf{global Christian missions community}
or other non-profit and relief organizations.
The \textbf{Taylor Center for Missions Computing}
is a key partner in this regard.
As a good citizen of the Taylor community,
Studio also sometimes develops products for other parts of the university.
\subsection{Software Studio is Intensely Practical}
\label{sec:orgheadline7}
Studio teaches you the skills necessary
to deliver amazing products to our customers.
We focus on two broad categories of skills:
\emph{software} skills and \emph{system} skills.

\textbf{Software skills} include requirements elicitation, coding, debugging, unit testing,
revision control, continuous integration, continuous deployment,
project management, code reviews, and defect tracking.

\textbf{System skills} include, operating system virtualization; installation, configuration,
maintenance, and administration of the operating system, network, database management
system, and web server; software deployment; and disaster planning
