cos472-sws.org
** Software Studio Fosters Teamwork
To foster teamwork,
we embrace the time-honored tradition of /apprenticeship/.
The medieval guild system classified practitioners into three groups:
/apprentice/, /journeyman/, and /master/.

An /apprentice/ begun work as a young teen,
contracted to a /master/ for five to nine years
in order to learn the master's trade.
The apprentice received no salary, but received room, board, and training
in exchange for work done on the master's behalf.

Upon learning the trade to the master's satisfaction,
the apprentice was released from the contract to become a /journeyman/.
The term, derived from the French word for /day/,
indicated that the journeyman was typically paid as a day laborer.
For the next few years,
the journeyman worked to hone
his[fn::Almost all participants in the medieval trades were men.]
skills and establish his own business and clientele.

After gaining sufficient experience,
the journeyman created a /master piece/
as demonstration of his mastery of the trade.
Full members of the craft guild---its /masters/---evaluated the piece
to determine whether it met the standards of the guild.
If so, the journeyman was himself admitted into the guild as a /master/,
which bestowed upon him both status and wealth.

Students new to Software Studio are considered /apprentices/.
As they gain experience, they advance to become /journeymen/ and, finally, /masters/.
The following table connects these roles to time spent in Software Studio.

#+ATTR_LATEX: :booktabs t
| Semester | Course  | Level        |
|----------+---------+--------------|
|        1 | COS 371 | Apprentice 1 |
|        2 | COS 372 | Apprentice 2 |
|        3 | COS 471 | Journeyman   |
|        4 | COS 472 | Master       |

In Software Studio, our expectations for each group of practitioners
include the following:
1. /Apprentice/
   + Focus on learning the tools and techniques we employ
   + Contribute meaningfully to the product while learning
   + Seek help from other team members when wedged
   + Shoulder more responsibility throughout your first year
2. /Journeyman/
   + Focus on growing both the depth and the breadth of your understanding
   + Share your knowledge with other team members---especially apprentices
   + Learn how to learn on your own
   + Know when to ask for help when you find yourself stuck on something new
   + Engineer substantial portions of the product
   + Prepare to shoulder the responsibilities of a master
3. /Master/
   + Focus on leading the team and delivering the product
   + Actively seek to provide help to other team members when they're wedged
   + Develop journeymen on the team to move them
     toward mastery---they will be taking your place soon
   + Evaluate the performance of team members
   + Take on the most challenging aspects of product development
   + Continue to hone your understanding of new or advanced tools and techniques
   + Interact with customer stakeholders to ensure a high quality product---one that
     conforms fully to customer requirements
* Content
Software Studio is about /software/ and /scholarship/.
** Software
The majority of your time will be devoted to the design, development,
testing, and deployment of production-quality software systems.

We use an agile software process based on the industry standard *Scrum* methodology.
The semester is organized into (mostly) three-week sprints,
giving us five sprints over the course of each 15-week semester.
Except for the first sprint, our class time during each sprint will be spent roughly as
illustrated in this table.

#+ATTR_LATEX: :booktabs t
| Week | Day | First Hour           | Second Hour             |
|------+-----+----------------------+-------------------------|
|    1 | T   | Sprint Retrospective | Sprint Planning         |
|      | R   | Work                 | Work                    |
|------+-----+----------------------+-------------------------|
|    2 | T   | Reading Discussion   | Hot Topic/Guest Speaker |
|      | R   | Work                 | Work                    |
|------+-----+----------------------+-------------------------|
|    3 | T   | Sys Admin            | Work                    |
|      | R   | Team Leads/Work      | Work                    |

The first day of a sprint comprises
a /sprint retrospective/ on the previous sprint
and /sprint planning/ for the upcoming sprint.
Combining these activities on the same class day
simplifies meeting with our customer.
Sprint planning meetings will proceed as follows:
1. Customer confirms that the top stories on the backlog
   are indeed the top priority for implementation in the sprint.
2. Senior members of the team (masters, journeymen) are assigned as /team leads/
   for each story in the sprint.
3. For each story, the team lead will:
   1. Estimate the story duration and enter the estimate into the task tracker.
   2. Break the story into tasks.
   3. Assign a team member as /owner/ of each tasks.
4. For each task, the task owner will estimate task duration and enter it into the task tracker.
No work should begin on a story until all these steps are completed.
Our goal is to complete all the steps in class on the day of sprint planning.

The single largest activity during class time is doing actual /work/ on the project.
Other activities during the sprint are as follows.
+ /Reading discussion/ of a paper or other reading that I will assign at the
  beginning of the sprint.
+ A /hot topic/ relevant to the class, the project, or to software development in general.
  Our speaker may be me, a member of the team, or a guest speaker.
+ Because you must know not only how to build a software system,
  but also how to deploy and administer it, each sprint will include
  a key topic related to /system administration/.
+ On the last class day of each sprint,
  I will meet with team leads for a face-to-face update.

At the beginning of the semester,
we will spend one week on introduction and on-boarding activities,
followed by a two-week "mini-sprint" as shown in this table.

#+ATTR_LATEX: :booktabs t
| Week | Day | First Hour          | Second Hour             |
|------+-----+---------------------+-------------------------|
|    1 | T   | Course Introduction | On-boarding             |
|      | R   | On-boarding         |                         |
|------+-----+---------------------+-------------------------|
|    2 | T   | Sprint Planning     |                         |
|      | R   | Work                | Work                    |
|------+-----+---------------------+-------------------------|
|    3 | T   | Reading Discussion  | Hot Topic/Guest Speaker |
|      | R   | Team Leads/Work     | Work                    |

During /on-boarding/, the entire team focuses on getting up to speed with the development
environment, tools, and processes to be employed during the semester. New students
(Apprentice 1) will each be assigned a senior member of the team (Master or Journeyman) as
a mentor. The mentor is responsible to ensure that the apprentice has the proper
environment and tools available, and that he or she understands all aspects of the
development process sufficiently in order to begin contributing meaningfully to the
product at the beginning of the mini-sprint.
** Scholarship
The /reading discussion/ and /hot topic/ activities mentioned above
add to your /scholarly understanding/ through
reading, discussion, and special speakers.
Readings for the course can be either classic or current papers, magazine articles,
and book chapters that address critical issues in software engineering.  Reading topics
include requirements, design, construction, testing, maintenance, configuration, quality
management, process, methods, and ethics.
* Mechanics
