cos472-sws.tex
\subsection{Software Studio Fosters Teamwork}
\label{sec:orgheadline8}
To foster teamwork,
we embrace the time-honored tradition of \emph{apprenticeship}.
The medieval guild system classified practitioners into three groups:
\emph{apprentice}, \emph{journeyman}, and \emph{master}.

An \emph{apprentice} begun work as a young teen,
contracted to a \emph{master} for five to nine years
in order to learn the master's trade.
The apprentice received no salary, but received room, board, and training
in exchange for work done on the master's behalf.

Upon learning the trade to the master's satisfaction,
the apprentice was released from the contract to become a \emph{journeyman}.
The term, derived from the French word for \emph{day},
indicated that the journeyman was typically paid as a day laborer.
For the next few years,
the journeyman worked to hone
his\footnote{Almost all participants in the medieval trades were men.}
skills and establish his own business and clientele.

After gaining sufficient experience,
the journeyman created a \emph{master piece}
as demonstration of his mastery of the trade.
Full members of the craft guild---its \emph{masters}---evaluated the piece
to determine whether it met the standards of the guild.
If so, the journeyman was himself admitted into the guild as a \emph{master},
which bestowed upon him both status and wealth.

Students new to Software Studio are considered \emph{apprentices}.
As they gain experience, they advance to become \emph{journeymen} and, finally, \emph{masters}.
The following table connects these roles to time spent in Software Studio.

\begin{center}
\begin{tabular}{rll}
\toprule
Semester & Course & Level\\
\midrule
1 & COS 371 & Apprentice 1\\
2 & COS 372 & Apprentice 2\\
3 & COS 471 & Journeyman\\
4 & COS 472 & Master\\
\bottomrule
\end{tabular}
\end{center}

In Software Studio, our expectations for each group of practitioners
include the following:
\begin{enumerate}
\item \emph{Apprentice}
\begin{itemize}
\item Focus on learning the tools and techniques we employ
\item Contribute meaningfully to the product while learning
\item Seek help from other team members when wedged
\item Shoulder more responsibility throughout your first year
\end{itemize}
\item \emph{Journeyman}
\begin{itemize}
\item Focus on growing both the depth and the breadth of your understanding
\item Share your knowledge with other team members---especially apprentices
\item Learn how to learn on your own
\item Know when to ask for help when you find yourself stuck on something new
\item Engineer substantial portions of the product
\item Prepare to shoulder the responsibilities of a master
\end{itemize}
\item \emph{Master}
\begin{itemize}
\item Focus on leading the team and delivering the product
\item Actively seek to provide help to other team members when they're wedged
\item Develop journeymen on the team to move them
toward mastery---they will be taking your place soon
\item Evaluate the performance of team members
\item Take on the most challenging aspects of product development
\item Continue to hone your understanding of new or advanced tools and techniques
\item Interact with customer stakeholders to ensure a high quality product---one that
conforms fully to customer requirements
\end{itemize}
\end{enumerate}
\section{Content}
\label{sec:orgheadline12}
Software Studio is about \emph{software} and \emph{scholarship}.
\subsection{Software}
\label{sec:orgheadline10}
The majority of your time will be devoted to the design, development,
testing, and deployment of production-quality software systems.

We use an agile software process based on the industry standard \textbf{Scrum} methodology.
The semester is organized into (mostly) three-week sprints,
giving us five sprints over the course of each 15-week semester.
Except for the first sprint, our class time during each sprint will be spent roughly as
illustrated in this table.

\begin{center}
\begin{tabular}{rlll}
\toprule
Week & Day & First Hour & Second Hour\\
\midrule
1 & T & Sprint Retrospective & Sprint Planning\\
 & R & Work & Work\\
\midrule
2 & T & Reading Discussion & Hot Topic/Guest Speaker\\
 & R & Work & Work\\
\midrule
3 & T & Sys Admin & Work\\
 & R & Team Leads/Work & Work\\
\bottomrule
\end{tabular}
\end{center}

The first day of a sprint comprises
a \emph{sprint retrospective} on the previous sprint
and \emph{sprint planning} for the upcoming sprint.
Combining these activities on the same class day
simplifies meeting with our customer.
Sprint planning meetings will proceed as follows:
\begin{enumerate}
\item Customer confirms that the top stories on the backlog
are indeed the top priority for implementation in the sprint.
\item Senior members of the team (masters, journeymen) are assigned as \emph{team leads}
   for each story in the sprint.
\item For each story, the team lead will:
\begin{enumerate}
\item Estimate the story duration and enter the estimate into the task tracker.
\item Break the story into tasks.
\item Assign a team member as \emph{owner} of each tasks.
\end{enumerate}
\item For each task, the task owner will estimate task duration and enter it into the task tracker.
\end{enumerate}
No work should begin on a story until all these steps are completed.
Our goal is to complete all the steps in class on the day of sprint planning.

The single largest activity during class time is doing actual \emph{work} on the project.
Other activities during the sprint are as follows.
\begin{itemize}
\item \emph{Reading discussion} of a paper or other reading that I will assign at the
beginning of the sprint.
\item A \emph{hot topic} relevant to the class, the project, or to software development in general.
Our speaker may be me, a member of the team, or a guest speaker.
\item Because you must know not only how to build a software system,
but also how to deploy and administer it, each sprint will include
a key topic related to \emph{system administration}.
\item On the last class day of each sprint,
I will meet with team leads for a face-to-face update.
\end{itemize}

At the beginning of the semester,
we will spend one week on introduction and on-boarding activities,
followed by a two-week ``mini-sprint'' as shown in this table.

\begin{center}
\begin{tabular}{rlll}
\toprule
Week & Day & First Hour & Second Hour\\
\midrule
1 & T & Course Introduction & On-boarding\\
 & R & On-boarding & \\
\midrule
2 & T & Sprint Planning & \\
 & R & Work & Work\\
\midrule
3 & T & Reading Discussion & Hot Topic/Guest Speaker\\
 & R & Team Leads/Work & Work\\
\bottomrule
\end{tabular}
\end{center}

During \emph{on-boarding}, the entire team focuses on getting up to speed with the development
environment, tools, and processes to be employed during the semester. New students
(Apprentice 1) will each be assigned a senior member of the team (Master or Journeyman) as
a mentor. The mentor is responsible to ensure that the apprentice has the proper
environment and tools available, and that he or she understands all aspects of the
development process sufficiently in order to begin contributing meaningfully to the
product at the beginning of the mini-sprint.
\subsection{Scholarship}
\label{sec:orgheadline11}
The \emph{reading discussion} and \emph{hot topic} activities mentioned above
add to your \emph{scholarly understanding} through
reading, discussion, and special speakers.
Readings for the course can be either classic or current papers, magazine articles,
and book chapters that address critical issues in software engineering.  Reading topics
include requirements, design, construction, testing, maintenance, configuration, quality
management, process, methods, and ethics.
