cos472-sws.org
** Attendance
Physical attendance is required. I will be in class each day, and I expect you to be there
also. In general, I am very understanding about students who must miss class due to a
sanctioned Taylor activity, job interview, family emergency, and the like. If possible,
let me know in advance if you will not be in class. I will work with you to arrange
make-up instruction, homework, quizzes, etc.

** Moodle
The Computer Science and Engineering department uses Moodle as our Learning Management
System. The URL for Moodle is https://moodle.cse.taylor.edu.
To sign on to the course site for the first time, you will need an enrollment key.
The key for this course is =nerds4christ=.

You are responsible for checking Moodle regularly to keep up with assignment due dates and
other announcements posted to the site. For due dates, the Moodle calendar is your friend.

* Evaluation
Detailed grading criteria for the course will be announced in the next few days.
* Final Deliverables
Final deliverables are required of all students, as detailed in this section.
# Grades are assigned as follows.
# Details for each grade item appears below.

# #+ATTR_LATEX: :booktabs t
# | Course Work          | Weight |
# |----------------------+--------|
# |                      | <r>    |
# | Time Log             |    25% |
# | Software Development |    25% |
# | Teamwork             |    10% |
# | Scholarship          |    15% |
# | Final Deliverables   |    25% |
# |----------------------+--------|
# | Total                |   100% |

# Refer to my /Periodic Table of the Grades/ (on Moodle) for my standard grading scheme.
# I reserve the right to award a higher grade than strictly earned;
# outstanding attendance, class participation, and excellence in software develoment
# figure prominently in such decisions.

# ** Time Log
# Across campus, the expectation is that for each hour of course credit,
# you will spend one hour /in class/ and two hours working /outside of class/.
# Because SWS is a four-credit class,
# the weekly expected workload is /twelve hours/ (including class time).

# Using our standard time tracking tool,
# you are responsible for tracking all your Software Studio time,
# including classes, team meetings, individual development, and self study.

# ** Software Development and Teamwork
# Most of your heads-down work for Software Studio takes place outside of class.
# Consequently, it is difficult for me to evaluate thoroughly your performance as
# a member of your software development team.
# During class, I will observe your participation with your team,
# your software development practices, and work with you to create and debug code.
# I will also evaluate team leads as part of our regular meetings at the
# conclusion of each sprint.
# Outside of class, I will inspect your commits to revision control,
# run code and tests you've written, and so forth.

# In addition, I rely on weekly peer evaluation
# from both /team leads/ and /team members/
# to supplement my limited observations.
# /Team leads/ evaluate team members on:
# + Participating as a member of the team, including:
#   - Availability to contribute to the project
#   - Working concurrently with other team members
#   - Conformance to customer requirements
#   - Making and keeping commitments regarding project deliverables
#   - Collaboration and cooperation with other team members
# + Exhibiting behaviors appropriate to the team member's level in the
#   class (i.e., apprentice, journeyman, master)
# + Excelling in software development, documentation, and testing, including:
#   - Code organization, structure, and clarity
#   - Sound use of design patterns
#   - Good coding practices, adherence to common standards, naming, etc.
#   - Appropriate code reuse (no duplicate code, use of libraries, etc.)
#   - Separation of concerns (e.g., UI, logic, persistence)
#   - Complete test coverage, ease of test execution
#   - Clear, concise, and sufficient internal documentation (comments)
# /Team members/ evaluate team leads on:
# + Interpreting customer requirements
# + Discharging responsibilities according to their level in the class (master,
#   journeyman)
# + Assigning and monitoring the team's work
# + Coordinating and facilitating group work
# + Providing process guidance to team members
# + Mentoring team members appropriate to their level in the class

# ** Scholarship
# You must demonstrate comprehension and application of the
# scholarly material we cover in class.
# Evidence I will look for includes:
# + Demonstrated understanding of reading assignments through
#   coherent comments and questions during discussion
# + Full participation in classroom discussions of papers and
#   special topics, and with guest speakers
# + Willingness to present on special topics or to share
#   your knowledge in classroom discussion

** Final Deliverables for COS 371, 372, and 471
Write a paper about your personal experience in Software Studio this term. The goal of
this paper is not to critique the class, your project, or your team, but to reflect on
your own experience in the class and how you matured as a software engineer.

Your paper should address at least the following questions. As appropriate, include ideas
from the reading and in-class presentations, your individual experience, and your personal
participation on your project.
+ What was the most important knowledge you acquired as it relates to your future as a
  professional software engineer?
+ Similarly, what were the most important skills you acquired or honed?
+ What did you learn about yourself as it relates to being a member of a team?
+ How did your experience in the class speak to your vocational call as a Christ follower?

These questions are not intended to be exhaustive. You are encouraged to reflect in your
paper on any additional insights you gleaned from your experience in the class this term.

Type (double space) your paper. Use good spelling, grammar, punctuation, and
structure. Your paper should be between 1,000 and 1,250 words long.

