cos472-sws.tex
\section{Mechanics}
\label{sec:orgheadline15}
\subsection{Attendance}
\label{sec:orgheadline13}
Physical attendance is required. I will be in class each day, and I expect you to be there
also. In general, I am very understanding about students who must miss class due to a
sanctioned Taylor activity, job interview, family emergency, and the like. If possible,
let me know in advance if you will not be in class. I will work with you to arrange
make-up instruction, homework, quizzes, etc.

\subsection{Moodle}
\label{sec:orgheadline14}
The Computer Science and Engineering department uses Moodle as our Learning Management
System. The URL for Moodle is \url{https://moodle.cse.taylor.edu}.
To sign on to the course site for the first time, you will need an enrollment key.
The key for this course is \texttt{nerds4christ}.

You are responsible for checking Moodle regularly to keep up with assignment due dates and
other announcements posted to the site. For due dates, the Moodle calendar is your friend.

\section{Evaluation}
\label{sec:orgheadline16}
Detailed grading criteria for the course will be announced in the next few days.
\section{Final Deliverables}
\label{sec:orgheadline19}
Final deliverables are required of all students, as detailed in this section.

\subsection{Final Deliverables for COS 371, 372, and 471}
\label{sec:orgheadline17}
Write a paper about your personal experience in Software Studio this term. The goal of
this paper is not to critique the class, your project, or your team, but to reflect on
your own experience in the class and how you matured as a software engineer.

Your paper should address at least the following questions. As appropriate, include ideas
from the reading and in-class presentations, your individual experience, and your personal
participation on your project.
\begin{itemize}
\item What was the most important knowledge you acquired as it relates to your future as a
professional software engineer?
\item Similarly, what were the most important skills you acquired or honed?
\item What did you learn about yourself as it relates to being a member of a team?
\item How did your experience in the class speak to your vocational call as a Christ follower?
\end{itemize}

These questions are not intended to be exhaustive. You are encouraged to reflect in your
paper on any additional insights you gleaned from your experience in the class this term.

Type (double space) your paper. Use good spelling, grammar, punctuation, and
structure. Your paper should be between 1,000 and 1,250 words long.
