cos472-sws.org
** Final Deliverables for COS 472
As partial demonstration of their mastery of the discipline,
/all/ CS&E students complete and present a substantial project
during their senior year. All students are required to
prepare and preset a poster regarding some aspect of their work
during their degree program

Most students satisfy this degree requirement
through COS 492 (Senior Project).
As a Software Studio student, you are not required to take COS 492;
instead, you satisfy these requirements as part of Software Studio IV.

An important decision that you should make early in your fourth semester of Software
Studio (if not before) is the topic for your paper, presentation, and poster.
You should meet with me no later than mid-term to discuss candidate topics.
Here are some general guidelines:

+ In your first three semesters of Software Studio, you wrote a simple experience paper.
  Your topic for Software Studio IV, however, must be much weightier.
+ You may focus on one or more non-trivial projects that you undertook
  during your time in Software Studio.
+ You may choose as your topic some idea related to Software Studio that was not the
  direct subject of one of your projects.

# Following is  detailed guidance on the three key deliverables for
# Software Studio IV.

# *** Paper

# Prepare a formal paper that would be suitable for publication in a professional journal or
# for presentation as a report on professional software development. Observe the following
# guidelines.

# 1. You are responsible to determine the appropriate style and topic for your paper. I will
#    help.
# 2. Your paper should be a minimum of eight to ten pages long
#    (between 2,000 and 2,500 words).
# 3. You must submit a draft of your paper three weeks prior to the end of the semester so
#    that I have time to review it and you have time to revise it.
# 4. The paper counts as 15% of your semester grade.
# 5. The Computer Science and Engineering department will make your paper publically
#    available unless doing so would be restricted by the requirements of a journal or
#    conference for which your paper is accepted for publication.
# 6. You are advised to seek writing assistance from the Writing Center, located in the
#    Academic Enrichment Center in the library.
# 7. Your paper will be evaluated on the following criteria.
#    + Format and style appropriate to the topic
#    + Abstract gives a concise and complete overview of the paper
#    + Introduction justifies the utility of the paper and sets out a road map of the body
#      of the paper
#    + Overview of related work sets the contributions of the paper in context
#    + Body clearly communicates the essence of the work reported in the paper, including
#      research or engineering methodology, artifacts created, analysis and reporting
#      techniques employed, key procedures followed, etc.
#    + Concludes with a concise and accurate statement of the research performed,
#      development completed, and the specifics and significance of the results obtained
#    + Employs correct terminology and notation
#    + Uses correct spelling and grammar and reads clearly and cohesively; written in the
#      active voice

# *** Presentation

# Your ability to prepare and present an oral presentation in a professional setting is a
# key element of the course. In particular, it meets part of the Senior Comprehensive
# requirements and allows the course to be listed for SP credit. Observe these guidelines.

# 1. You are responsible to determine the appropriate content, style, and format for your
#    presentation. I will help.
# 2. Your presentation should include professional-grade supporting visual materials.
# 3. You must submit a draft of your presentation outline and visual materials three weeks
#    prior to the end of the semester so that I have time to review them and you have time
#    to revise them.
# 4. Faculty and students of the department will be invited and encouraged to attend your
#    presentation.
# 5. The presentation counts as 15% of your semester grade.
# 6. Your presentation will be evaluated on the following criteria.
#    + Duration not to exceed 30 minutes, including audience Q&A
#    + Quality of visual material
#    + Appropriate mannerisms, eye contact, etc.
#    + Spoken fluency, conciseness, and cohesiveness
#    + Minimal verbal noise ("um," "like," "you know," etc.)
#    + Appropriate attire
#    + Proper use of terminology and grammar
#    + Sufficient coverage of salient ideas relevant to your topic
#    + Understandability and appropriateness of material to the target audience

# *** Poster

You will prepare a poster describing your work and present the poster to visitors who
attend a poster session held by the department. Read, study, and evaluate past students'
posters (displayed at various locations around the department) to get a better idea of
what is expected of yours.

Guidelines for the poster are as follows.

1. Use a clean, clear layout that employs good layout and design, clear fonts, meaningful
   colors, etc.
2. Employ graphics (photos, illustrations, charts, graphs, figures, etc.) that enhance the
   poster's message.
3. Make evident the topic of your poster and the contributions that your work in the area
   has made.
4. Present your ideas logically and clearly so that your poster can be understood by a
   reader whether you are there to explain it or not.

Observe these guidelines from our system administrators on the preparation of your poster.

+ Most students use PowerPoint, although Adobe Illustrator is better designed to do
  large-format printing. We can print from most apps that can print (Photoshop, Word,
  Excel, Open Office, etc.), and can enlarge prints from page size to whatever poster size
  you need.
+ We can print from PDFs, although we suggest that you provide the original file format if
  you are using an app that we support. We can also print from JPEGs if you simply wish to
  print photos.
+ Our paper widths are 24, 36, and 42 inches. The printer is not capable of printing
  larger than 42 inches. Paper length is variable.
+ Avoid using a dark background unless the dark background is important in conveying your
  message. Dark backgrounds require /large/ amounts of ink, can gunk up the print heads,
  and cost more to print.
+ Visit http://www.swarthmore.edu/NatSci/cpurrin1/posteradvice.htm for sample templates
  that you may wish to use.
* Academic Integrity
As a student at an institution whose goal is to honor Christ in all that it does, I expect
you to uphold the strictest standards of academic integrity. You must do your own work,
cite others when you present their work, and never misrepresent your academic performance
in any way. Violation of these standards stains the reputations of you as a student,
Taylor as an institution, and Jesus as our Lord. Such a violation will result in your
failing the course and other disciplinary action by the University. Refer to the Taylor
catalog for the official statement of these ideas.
