cos472-sws.tex

\subsection{Final Deliverables for COS 472}
\label{sec:orgheadline18}
As partial demonstration of their mastery of the discipline,
\emph{all} CS\&E students complete and present a substantial project
during their senior year. All students are required to
prepare and preset a poster regarding some aspect of their work
during their degree program

Most students satisfy this degree requirement
through COS 492 (Senior Project).
As a Software Studio student, you are not required to take COS 492;
instead, you satisfy these requirements as part of Software Studio IV.

An important decision that you should make early in your fourth semester of Software
Studio (if not before) is the topic for your paper, presentation, and poster.
You should meet with me no later than mid-term to discuss candidate topics.
Here are some general guidelines:

\begin{itemize}
\item In your first three semesters of Software Studio, you wrote a simple experience paper.
Your topic for Software Studio IV, however, must be much weightier.
\item You may focus on one or more non-trivial projects that you undertook
during your time in Software Studio.
\item You may choose as your topic some idea related to Software Studio that was not the
direct subject of one of your projects.
\end{itemize}

You will prepare a poster describing your work and present the poster to visitors who
attend a poster session held by the department. Read, study, and evaluate past students'
posters (displayed at various locations around the department) to get a better idea of
what is expected of yours.

Guidelines for the poster are as follows.

\begin{enumerate}
\item Use a clean, clear layout that employs good layout and design, clear fonts, meaningful
colors, etc.
\item Employ graphics (photos, illustrations, charts, graphs, figures, etc.) that enhance the
poster's message.
\item Make evident the topic of your poster and the contributions that your work in the area
has made.
\item Present your ideas logically and clearly so that your poster can be understood by a
reader whether you are there to explain it or not.
\end{enumerate}

Observe these guidelines from our system administrators on the preparation of your poster.

\begin{itemize}
\item Most students use PowerPoint, although Adobe Illustrator is better designed to do
large-format printing. We can print from most apps that can print (Photoshop, Word,
Excel, Open Office, etc.), and can enlarge prints from page size to whatever poster size
you need.
\item We can print from PDFs, although we suggest that you provide the original file format if
you are using an app that we support. We can also print from JPEGs if you simply wish to
print photos.
\item Our paper widths are 24, 36, and 42 inches. The printer is not capable of printing
larger than 42 inches. Paper length is variable.
\item Avoid using a dark background unless the dark background is important in conveying your
message. Dark backgrounds require \emph{large} amounts of ink, can gunk up the print heads,
and cost more to print.
\item Visit \url{http://www.swarthmore.edu/NatSci/cpurrin1/posteradvice.htm} for sample templates
that you may wish to use.
\end{itemize}
\section{Academic Integrity}
\label{sec:orgheadline20}
As a student at an institution whose goal is to honor Christ in all that it does, I expect
you to uphold the strictest standards of academic integrity. You must do your own work,
cite others when you present their work, and never misrepresent your academic performance
in any way. Violation of these standards stains the reputations of you as a student,
Taylor as an institution, and Jesus as our Lord. Such a violation will result in your
failing the course and other disciplinary action by the University. Refer to the Taylor
catalog for the official statement of these ideas.
\end{document}